<article>
  <header>ดวงจันทร์ (Moon)</header>
  <p>
    เป็นศูนย์กลางของความสนใจและความหลงใหลของมนุษย์มาตั้งแต่อดีตถึงปัจจุบัน
    ดวงจันทร์เป็นลูกบอลขนาดใหญ่ที่อยู่ใกล้ๆ โลก
    ซึ่งเป็นดาวเคราะห์ของโลกที่ส่วนนี้
    เป็นที่รู้จักกันดีในรูปร่างของดวงจันทร์เต็มขนาดที่เรียกว่า
    "พระจันทร์เต็มดวง" (Full Moon)
    ซึ่งกล่าวถึงช่วงเวลาที่ดวงจันทร์แสดงอยู่ในด้านตรงข้ามกับด้านที่โลกอยู่
    ซึ่งทำให้ดวงจันทร์ดูสว่างและเต็มเสมอ
    ดวงจันทร์มีความสำคัญอย่างมากในแง่ของด้านวิทยาศาสตร์ ภูมิศาสตร์ และวัฒนธรรม
  </p>
  <details open>
    <summary>โดยมีลักษณะพิเศษที่น่าสนใจดังนี้</summary>
    <ul>
      <li>
        1. การหมุนรอบตัวเอง: ดวงจันทร์หมุนรอบตัวเองอย่างเต็มรอบในระยะเวลา 27.3
        วัน
        ซึ่งเป็นระยะเวลาเท่ากับเวลาที่ใช้ในการรอบรู้ว่าดวงจันทร์ทำลายตัวเองอย่างไร
        ดังนั้นเราเห็นดวงจันทร์แค่ด้านเดียวเสมอ
      </li>
      <li>
        2. การเป็นเพื่อนร่วมโลก: ดวงจันทร์มีบทบาททางโกโหลกอย่างสำคัญ
        เนื่องจากมีผลต่อเหตุการณ์ทางธรรมชาติที่เกิดขึ้นบนโลก เช่น กระแสน้ำทะเล
        ความร้อนของโลก และอาการน้ำท่วมต่างๆ
      </li>
      <li>
        3. ดวงจันทร์ในวัฒนธรรม: ในทุกสังคมและวัฒนธรรม
        ดวงจันทร์เป็นสัญลักษณ์ที่มีความหมายสำคัญ เช่น
        การถวายเครื่องราชแก่พระจันทร์ในประเพณีของบางชนชาติ
        การนับเวลาตามรอบจันทรคำนวณสำหรับเกษตรกร และมีบทบาทสำคัญในตำนานและนิทาน
      </li>
      <li>
        4. การสำรวจดวงจันทร์: ตั้งแต่ยุคยานอวกาศอเมริกาแรก Apollo ในปี 1969
        ไปจนถึงปัจจุบัน
        มนุษย์ได้ทำการสำรวจดวงจันทร์เพื่อศึกษาและวิจัยในด้านต่างๆ
        รวมถึงศึกษาความเป็นไปได้ในการส่งมนุษย์ไปอยู่ในดวงจันทร์ในอนาคต
      </li>
      <li>
        5. ดวงจันทร์ในภูมิศาสตร์:
        รูปแบบของดวงจันทร์เปลี่ยนไปตามช่วงเวลาที่เรียกว่า "Phase"
        ซึ่งมีเชื่อมโยงกับการเห็นดวงจันทร์บนท้องฟ้าของโลก
        ระหว่างช่วงเวลาของดวงจันทร์ในช่วงเวลานั้น
        ความสว่างของดวงจันทร์ที่เราเห็นก็จะมีความแตกต่างกัน
        ดวงจันทร์เป็นเหตุการณ์ที่น่าทึ่งและน่าศึกษาในห้องสมุดศาสตร์
        มนุษย์ยังคงต้องการสำรวจและศึกษาเพื่อเข้าใจความลึกลับของดวงจันทร์และความสัม
      </li>
    </ul>
    <span>ผู้เขียนโดย: <a href="https://chat.openai.com/" target="_blank"> chatgpt</a></span>
  </details>
</article>

<style>
  @import url("https://fonts.googleapis.com/css2?family=Kodchasan&display=swap");

  article {
    font-family: "Kodchasan" !important;
    color: white;
    text-align: start;
    margin: 3.4rem 0;
    padding: 0 70px;
    word-wrap: break-word;
    letter-spacing: .3pt;
  }

  header{
    font-size: 38px;
    font-weight: bolder;
    text-align: center;
    margin: 24px 0;
  }
  p{
    margin: 12px 0;
  }
  ul {
    list-style: none;
    padding: 12px 30px;
    cursor: default;
  }
  ul > li{
    margin-block: 6px;
  }
  details{
    margin-inline:20px 0;
  }
  details > summary{
    font-size: 21px;
    color: aliceblue;
    cursor: pointer;
  }
  a:is(:visited , :link){
    text-decoration: none;
    color: rgb(37, 250, 133);
  }
  a:hover{
    text-decoration: underline;
  }
</style>
